linux/expect.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-20 Fri 22:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>expect自动化工具</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="qxg" />
<link rel="shortcut icon" type="image/x-icon" href="/static/img/favicon.ico">
<link rel="stylesheet" type="text/css" href="/static/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/static/css/readtheorg.css"/><link rel="stylesheet" type="text/css" href="/static/css/orgstyle.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/index.html"> UP </a>
 |
 <a accesskey="H" href="/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">expect自动化工具</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org77081f2">概述</a></li>
<li><a href="#org08bc764">example</a></li>
<li><a href="#org2153852">相关命令</a>
<ul>
<li><a href="#orgd4d9022">输入输出</a></li>
<li><a href="#org7152735">获取参数</a></li>
<li><a href="#org2ad3c3c">设置变量值</a></li>
<li><a href="#orgaaa4f70">spawn</a></li>
<li><a href="#org903956b">函数定义和调用</a></li>
<li><a href="#org259f4f0">循环</a></li>
<li><a href="#org397391a">if/switch</a></li>
<li><a href="#org86cca73">超时设置</a></li>
<li><a href="#org7d806c3">字符串操作</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org77081f2" class="outline-2">
<h2 id="org77081f2">概述</h2>
<div class="outline-text-2" id="text-org77081f2">
<p>
在登录一些机器的时候使用ssh来进行登录，需要填写密码，但是这种情况能不能自动化呢。答案是可以，相应的工具就是expect.expect是一个工具，不是linux自带的，所有使用前需要进行安装，如通过 <code>brew</code> 来进行安装。如果不会的话，百度一下。
</p>
</div>
</div>
<div id="outline-container-org08bc764" class="outline-2">
<h2 id="org08bc764">example</h2>
<div class="outline-text-2" id="text-org08bc764">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #75715E;">#</span><span style="color: #75715E;">!/usr/bin/</span><span style="color: #F92672;">expect</span><span style="color: #75715E;">  # &#35201;&#25191;&#34892;expect&#24517;&#39035;&#26377;&#27492;&#24320;&#22836;&#65292;&#34920;&#31034;&#20351;&#29992;expect&#36827;&#34892;&#25191;&#34892;&#65292;&#20854;&#31867;&#20284;sh</span>
<span style="color: #75715E;">#</span><span style="color: #75715E;">set timeout 20 # &#35774;&#32622;&#36229;&#26102;&#26102;&#38388; &#22914;&#26524;&#27809;&#35774;&#32622;&#65292;&#37027;&#20040;expect&#22312;&#27809;&#26377;&#25910;&#21040;&#30456;&#24212;&#30340;&#23383;&#31526;&#30340;&#26102;&#20505;&#65292;&#23601;&#20250;&#26681;&#25454;&#36229;&#26102;&#26102;&#38388;&#36864;&#20986;&#12290;</span>
spawn ssh root@192.168.43.131  <span style="color: #75715E;"># </span><span style="color: #75715E;">spawn&#20250;&#21478;&#36215;&#19968;&#20010;&#36827;&#31243;&#65292;&#24182;&#25191;&#34892;&#21518;&#36793;&#30340;&#25351;&#20196;,&#24320;&#36827;&#31243;&#21518;&#21487;&#20351;&#29992;expect/send&#19982;&#35813;&#36827;&#31243;&#36827;&#34892;&#20132;&#20114;&#12290;</span>
expect <span style="color: #E6DB74;">"*password:"</span>  <span style="color: #75715E;"># </span><span style="color: #75715E;">expect &#22914;&#26524;&#20986;&#29616;&#20102;&#21518;&#36793;&#36319;&#30340;&#23383;&#31526;&#65292;&#21017;&#20250;&#25191;&#34892;&#21518;&#32493;&#30340;&#25351;&#20196;&#65292;&#21542;&#21017;&#20250;&#26377;&#36229;&#26102;&#26102;&#38388;&#65292;&#24182;&#31435;&#21363;&#36864;&#20986;</span>
send <span style="color: #E6DB74;">"123\r"</span> <span style="color: #75715E;"># </span><span style="color: #75715E;">&#31867;&#20284;&#20154;&#24037;&#36755;&#20837;&#21629;&#20196;&#65292;&#22312;expect&#21518;&#21487;&#20197;&#36827;&#34892;&#21457;&#36865;&#21629;&#20196;&#12290;</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">expect "*#"</span>
<span style="color: #75715E;"># </span><span style="color: #75715E;">&#25968;&#32452;&#26684;&#24335;&#30340;expect</span>
expect {
    <span style="color: #E6DB74;">"*password:*"</span> {
        <span style="color: #75715E;"># </span><span style="color: #75715E;">do something</span>
    }
    <span style="color: #E6DB74;">"*second*"</span> {

    }
}
interact <span style="color: #75715E;"># </span><span style="color: #75715E;">&#25191;&#34892;&#23436;&#27605;&#21518;&#23558;&#35813;&#36827;&#31243;&#30340;&#25511;&#21046;&#26435;&#20132;&#32473;&#29992;&#25143;&#12290;&#22914;&#26524;&#27809;&#26377;&#65292;&#21017;&#25191;&#34892;&#23436;&#23601;&#20250;&#36864;&#20986;&#12290;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2153852" class="outline-2">
<h2 id="org2153852">相关命令</h2>
<div class="outline-text-2" id="text-org2153852">
</div>
<div id="outline-container-orgd4d9022" class="outline-3">
<h3 id="orgd4d9022">输入输出</h3>
<div class="outline-text-3" id="text-orgd4d9022">
<p>
使用 <code>puts</code> 进行输出:
</p>
<div class="org-src-container">
<pre class="src src-shell">puts stderr <span style="color: #E6DB74;">"Usage: $argv0 login passwaord.n "</span>
puts <span style="color: #E6DB74;">"hello world"</span>
puts stdout <span style="color: #E6DB74;">"1234"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7152735" class="outline-3">
<h3 id="org7152735">获取参数</h3>
<div class="outline-text-3" id="text-org7152735">
<p>
使用$arg0 $arg1 &#x2026; 等来获取传入的参数, $argc是参数的长度:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #F92672;">if</span> {$<span style="color: #FD971F;">argc</span> &lt; 2} {
    puts stdout <span style="color: #E6DB74;">"$argv0 err params\n"</span>
    <span style="color: #F92672;">exit</span> 1
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org2ad3c3c" class="outline-3">
<h3 id="org2ad3c3c">设置变量值</h3>
<div class="outline-text-3" id="text-org2ad3c3c">
<p>
使用 <code>set</code> 命令:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #F92672;">set</span> user [lindex $<span style="color: #FD971F;">argv</span> 0] <span style="color: #75715E;"># </span><span style="color: #75715E;">lindex&#34920;&#31034;&#21462;&#20986;&#26576;&#20010;&#25968;&#32452;&#20013;&#30340;&#20540;&#65292;&#22914;&#27492;&#22788;&#34920;&#31034;&#21462;&#20986;argv&#25968;&#32452;&#20013;&#30340;&#19979;&#26631;0&#30340;&#20540;&#12290;</span>
<span style="color: #F92672;">set</span> password [lindex $<span style="color: #FD971F;">argv</span> 1]
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaaa4f70" class="outline-3">
<h3 id="orgaaa4f70">spawn</h3>
<div class="outline-text-3" id="text-orgaaa4f70">
<p>
开启一个进程来执行后边跟着的命令:
</p>
<div class="org-src-container">
<pre class="src src-shell">spawn ls -l
</pre>
</div>
</div>
</div>
<div id="outline-container-org903956b" class="outline-3">
<h3 id="org903956b">函数定义和调用</h3>
<div class="outline-text-3" id="text-org903956b">
<div class="org-src-container">
<pre class="src src-shell">proc fnName {para1 para2} { 

}

fnName $<span style="color: #FD971F;">argv0</span> $<span style="color: #FD971F;">argv1</span> <span style="color: #75715E;"># </span><span style="color: #75715E;">&#35843;&#29992;</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org259f4f0" class="outline-3">
<h3 id="org259f4f0">循环</h3>
<div class="outline-text-3" id="text-org259f4f0">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #F92672;">while</span> (<span style="color: #F92672;">true</span>) { 

}
</pre>
</div>
</div>
</div>
<div id="outline-container-org397391a" class="outline-3">
<h3 id="org397391a">if/switch</h3>
<div class="outline-text-3" id="text-org397391a">
<div class="org-src-container">
<pre class="src src-shell">switch -- $<span style="color: #FD971F;">var</span> { 

0 {

  } 
1 {

  }
}

<span style="color: #F92672;">if</span> { $<span style="color: #FD971F;">param</span> == <span style="color: #E6DB74;">"haha"</span> } { <span style="color: #75715E;"># </span><span style="color: #75715E;">&#27880;&#24847;&#20854;&#20013;&#30340;&#25324;&#21495;</span>

} <span style="color: #F92672;">else</span> {

}
</pre>
</div>
</div>
</div>
<div id="outline-container-org86cca73" class="outline-3">
<h3 id="org86cca73">超时设置</h3>
<div class="outline-text-3" id="text-org86cca73">
<p>
expect默认执行的超时时间是10s,可以使用 <code>set timeout -1</code> 来设置永不超时,而 <code>set timeout 10</code> 则10s超时
</p>
</div>
</div>
<div id="outline-container-org7d806c3" class="outline-3">
<h3 id="org7d806c3">字符串操作</h3>
<div class="outline-text-3" id="text-org7d806c3">
<p>
字符串格式化:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #F92672;">set</span> tmp [format <span style="color: #E6DB74;">"--haha %s"</span> $<span style="color: #FD971F;">other</span>] // &#32473;tmp&#36171;format&#21518;&#30340;&#20540;
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: qxg</p>
<p class="date">Created: 2019-09-20 Fri 22:48</p>
<p class="validation"></p>
</div>
</body>
</html>
